{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_268": {"name": "keras_tensor_268:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/global_max_pooling1d_1/Max/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_268", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Cast", "op": "Cast", "input": ["keras_tensor_268"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_17_1/embedding_16_1/Cast", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_17_1/embedding_16_1/Cast", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_17_1/embedding_16_1/Less", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/add", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/SelectV2", "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2", "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims", "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/global_max_pooling1d_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/sequential_17_1/conv1d_1_1/add", "StatefulPartitionedCall/sequential_17_1/global_max_pooling1d_1/Max/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_17_1/global_max_pooling1d_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_17_1/conv1d_1_1/Relu", "StatefulPartitionedCall/sequential_17_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_17_1/dense_16_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_17_1/dense_16_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_17_1/dense_16_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/ReadVariableOp", "shape": [10000, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_17_1/embedding_16_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/convolution/ExpandDims_1", "shape": [1, 5, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_17_1/conv1d_1_1/Reshape", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_17_1/global_max_pooling1d_1/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Cast/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_17_1/dense_16_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}