{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_21": {"name": "keras_tensor_21:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "11"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_1_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "keras_tensor_21", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "11"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_1_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor_21", "StatefulPartitionedCall/sequential_1_1/dense_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_1_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_1_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_2_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_1_1/Cast/ReadVariableOp", "shape": [11, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_1_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}