{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_11": {"name": "input_layer_11:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20000"}, {"size": "300"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "300"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/global_max_pooling1d_10_1/Max/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_19_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_19_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_11", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}]}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Cast", "op": "Cast", "input": ["input_layer_11"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_11_1/embedding_11_1/Cast", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_11_1/embedding_11_1/Cast", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_11_1/embedding_11_1/Less", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/add", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/SelectV2", "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2", "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims", "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_11_1/conv1d_17_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_11_1/conv1d_17_1/Relu", "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "5", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "1", "5", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/global_max_pooling1d_10_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/Squeeze", "StatefulPartitionedCall/sequential_11_1/global_max_pooling1d_10_1/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_19_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_11_1/global_max_pooling1d_10_1/Max", "StatefulPartitionedCall/sequential_11_1/dense_19_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_11_1/dense_19_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_11_1/dense_19_1/Relu", "StatefulPartitionedCall/sequential_11_1/dense_20_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_11_1/dense_20_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_11_1/dense_20_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_11_1/dense_20_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/ReadVariableOp", "shape": [20000, 300], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/embedding_11_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/convolution/ExpandDims_1", "shape": [1, 5, 300, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/conv1d_17_1/Reshape", "shape": [1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/max_pooling1d_5_1/MaxPool1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/global_max_pooling1d_10_1/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_19_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_19_1/Add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_11_1/dense_20_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}